<img src="https://gitlab.com/bivl2ab/academico/cursos-uis/ai/ai-uis-student/raw/master/imgs/banner_IA.png"  width="1000px" height="200px">

# **Taller 02:  Pandas**

## **Outline**

1. [Ejercicio 1.](#eje1)
2. [Ejercicio 2.](#eje2)
2. [Ejercicio 3.](#eje3)
2. [Ejercicio 4.](#eje4)
2. [Ejercicio 5.](#eje5)

In [1]:
#@title **Execute this cell**
#@markdown Please include your student id
import sys
import inspect

group_id = "H2" #@param {type:"string"}
assignment_id = 'ai1-'+group_id +'.20212.python'
code_subject = '1'
student_id = "2210" #@param {type:"string"}
"""
Put your student ID here

Example: student_id =  '2152145'
"""

"\nPut your student ID here\n\nExample: student_id =  '2152145'\n"

In [2]:
#@title **Execute this cell**
#@markdown **UTILS**
#@markdown Please dont modify any line in this cell

import os
import json
import requests
from collections import namedtuple


Config = namedtuple('Config', ['server_name', 'course_name', 'student_id'])
config = Config(server_name='https://azuregrader.azurewebsites.net/api', 
                course_name='ai1', student_id='2162107')


def check_solution(assignment_id, student_func_str):

    # Set the endpoint and payload.
    payload = {'func_str': student_func_str, 'assignment_id': assignment_id}
    endpoint_url = config.server_name + '/CheckSolution'
    # print(endpoint_url)

    # Make request to server with the data coming from the notebook.
    r = requests.get(endpoint_url, params=payload)
    pprint_json_response(r.json())
    return r


def check_solution_and_evaluate(assignment_id: str, student_func_str: str):

    # Set the endpoint and payload.
    payload = {
        'func_str': student_func_str,
        'assignment_id': assignment_id,
        'student_id': student_id
    }
    endpoint_url = config.server_name + '/CheckAndEvaluateSolution'
    # print(endpoint_url)

    # Make request to server with the data coming from the notebook.
    r = requests.post(endpoint_url, params=payload)
    pprint_json_response(r.json())
    return r


def pprint_json_response(response, indent=0):
    """Pretty print the response."""
    for key, value in response.items():
        print('\t' * indent + str(key.capitalize()))

        # If dictionary, do a recurrent call.
        if isinstance(value, dict):
            pprint_json_response(value, indent + 1)
        else:
            # Enumerate elements if list.
            if isinstance(value, list):
                if len(value) == 1:
                    print('\t' * (indent + 1) + str(value[0]))
                else:
                    for i, e in enumerate(value, start=1):
                        print('\t' * (indent + 1) + f'{i}. {e}')
            else:
                print('\t' * (indent + 1) + str(value))

In [3]:
#@title **Import libraries**

import pandas as pd
import numpy as np

In [4]:
#@title Los **ejercicios 1 - 2** utilizan el siguiente dataset. 
#@markdown Cargue los datos y recuerde que están en un dataframe d
d = pd.read_csv("https://storage.googleapis.com/mledu-datasets/california_housing_train.csv", sep=",")
d.head(1)

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0

[1 rows x 9 columns]

---
# **Ejercicio 1**  <a name="eje1"></a>
---

Escriba una función que reciba el dataframe de `california_housing_train`, agrupe los valores por la columna  `total_rooms`. Luego cálcule la media para  la columna `median_house_value`.

- Retorne el nuevo dataframe.

In [ ]:
def groupby_dataframe(data):
  """Put your code here"""
  
  pass

In [ ]:
#@title **check your answer**
student_func_str = inspect.getsource(groupby_dataframe)
r = check_solution(assignment_id, student_func_str)

In [ ]:
#@title **send your answer**
student_func_str = inspect.getsource(groupby_dataframe)
r = check_solution_and_evaluate(assignment_id, student_func_str)

---
# **Ejercicio 2**  <a name="eje2"></a>
---

- Escriba una función que reciba el dataframe de `california_housing_train`
- Crear un nuevo dataframe que cuyas columnas sean el cálculo de `min`, `max`, `mean` and `std` de cada una de las columnas del dataframe original. 
- El resultado debe ser un dataframe con 5 columnas, donde la primera,  'nombre de las variables', sea la columna de referencia y las otras 4 los respectivos cálculos.
- Retorne el nuevo dataframe

In [13]:
def dataframe_statistics(data):

  import pandas as pd
  
  """Put your code here"""
    
  pass
dataframe_statistics(d)

                           min          max           mean            std
longitude            -124.3500    -114.3100    -119.562108       2.005166
latitude               32.5400      41.9500      35.625225       2.137340
housing_median_age      1.0000      52.0000      28.589353      12.586937
total_rooms             2.0000   37937.0000    2643.664412    2179.947071
total_bedrooms          1.0000    6445.0000     539.410824     421.499452
population              3.0000   35682.0000    1429.573941    1147.852959
households              1.0000    6082.0000     501.221941     384.520841
median_income           0.4999      15.0001       3.883578       1.908157
median_house_value  14999.0000  500001.0000  207300.912353  115983.764387

In [ ]:
#@title **check your answer**
student_func_str = inspect.getsource(dataframe_statistics)
r = check_solution(assignment_id, student_func_str)

In [ ]:
#@title **send your answer**
student_func_str = inspect.getsource(dataframe_statistics)
r = check_solution_and_evaluate(assignment_id, student_func_str)

In [25]:
#@title Los **ejercicios 3 - 5** utilizan el siguiente dataset. 
#@markdown Cargue los datos y recuerde que están en un dataframe ''`titanic`''

url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/07_Visualization/Titanic_Desaster/train.csv'
titanic = pd.read_csv(url)
titanic.head(1)

   PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
0            1         0       3  ...  7.25   NaN         S

[1 rows x 12 columns]

---
# **Ejercicio 3**  <a name="eje3"></a>
---
- Escriba una función que reciba el dataset '`titanic`'
- Elimine todas las filas que contienen al menos un registro `NaN`
- la columna Sex contiene los generos en  valores como:  `female`  y `male`. Reemplace los valores por `1`  y `0`, respectivamente.

In [ ]:
def replace_values(data):

  import pandas as pd
  
  """Put your code here"""
    
  pass

In [ ]:
#@title **check your answer**
student_func_str = inspect.getsource(replace_values)
r = check_solution(assignment_id, student_func_str)

In [ ]:
#@title **send your answer**
student_func_str = inspect.getsource(replace_values)
r = check_solution_and_evaluate(assignment_id, student_func_str)

---
# **Ejercicio 4**  <a name="eje4"></a>
---

- Realice una agrupación de '`titanic`' por la variable  `Pclass` 
- Seleccione las columnas `Age` and `Fare` y calcule `max`, `min` and `mean`, para cadacolumna y agregue la información como una nueva columna
- Retorne los resultados en un nuevo dataframe

In [26]:
def aggregated_titanic(data):  
  
  """Put your code here"""
    
  pass
aggregated_titanic(titanic)

         Age                       Fare
         max   min       mean       max  min       mean
Pclass
1       80.0  0.92  38.233441  512.3292  0.0  84.154687
2       70.0  0.67  29.877630   73.5000  0.0  20.662183
3       74.0  0.42  25.140620   69.5500  0.0  13.675550

In [ ]:
#@title **check your answer**
student_func_str = inspect.getsource(aggregated_titanic)
r = check_solution(assignment_id, student_func_str)

In [ ]:
#@title **send your answer**
student_func_str = inspect.getsource(aggregated_titanic)
r = check_solution_and_evaluate(assignment_id, student_func_str)

---
# **Ejercicio 5**  <a name="eje5"></a>
---
- Escriba una función que reciba como argumento el dataset '`titanic`'
- Agrupe por `Sex`and select the `Age` and `Survived`.
- Calcule la media de cada columna
- Retorne un nuevo dataframe con estos valores (2 rows, 2 columns).

In [31]:
def groupby_titanic(data):  
  
  """Put your code here"""
    
  pass
groupby_titanic(titanic)

              Age  Survived
Sex
female  27.915709  0.742038
male    30.726645  0.188908

In [ ]:
#@title **check your answer**
student_func_str = inspect.getsource(groupby_titanic)
r = check_solution(assignment_id, student_func_str)

In [ ]:
#@title **send your answer**
student_func_str = inspect.getsource(groupby_titanic)
r = check_solution_and_evaluate(assignment_id, student_func_str)

---
<img src="https://gitlab.com/bivl2ab/academico/cursos-uis/ai/ai-uis-student/raw/master/imgs/bannerThanks.jpg" alt="Drawing" style="width:700px;"/>